---
kind: method
id: M:Autodesk.Revit.DB.SelectionFilterElement.SetElementIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
source: html/1c3d03d1-e917-4513-f260-d8a33fa818ca.htm
---
# Autodesk.Revit.DB.SelectionFilterElement.SetElementIds Method

Replaces the set of ElementIds contained by this filter.

## Syntax (C#)
```csharp
public void SetElementIds(
	ICollection<ElementId> ids
)
```

## Parameters
- **ids** (`System.Collections.Generic.ICollection < ElementId >`) - The new set of ElementIds.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null